# !/usr/bin/env python3
# -*- coding:utf-8 -*-
# @Datetime : 2023/10/27 1:07
# @Author   : Fangyang
# @Software : PyCharm

f401_439_balance_sheet_dict = {
    '401专项储备(万元)': 'FFF401',
    '402结算备付金(万元)': 'FFF402',
    '403拆出资金(万元)': 'FFF403',
    '404发放贷款及垫款(万元)(流动资产科目)': 'FFF404',
    '405衍生金融资产(万元)': 'FFF405',
    '406应收保费(万元)': 'FFF406',
    '407应收分保账款(万元)': 'FFF407',
    '408应收分保合同准备金(万元)': 'FFF408',
    '409买入返售金融资产(万元)': 'FFF409',
    '410划分为持有待售的资产(万元)': 'FFF410',
    '411发放贷款及垫款(万元)(非流动资产科目)': 'FFF411',
    '412向中央银行借款(万元)': 'FFF412',
    '413吸收存款及同业存放(万元)': 'FFF413',
    '414拆入资金(万元)': 'FFF414',
    '415衍生金融负债(万元)': 'FFF415',
    '416卖出回购金融资产款(万元)': 'FFF416',
    '417应付手续费及佣金(万元)': 'FFF417',
    '418应付分保账款(万元)': 'FFF418',
    '419保险合同准备金(万元)': 'FFF419',
    '420代理买卖证券款(万元)': 'FFF420',
    '421代理承销证券款(万元)': 'FFF421',
    '422划分为持有待售的负债(万元)': 'FFF422',
    '423预计负债(万元)': 'FFF423',
    '424递延收益(万元)': 'FFF424',  # （流动负债科目，公告此科目的股票较少，大部分公司没有此数据）
    '425其中:优先股(万元)': 'FFF425',  # (非流动负债科目)
    '426永续债(万元)': 'FFF426',  # (非流动负债科目)
    '427长期应付职工薪酬(万元)': 'FFF427',
    '428其中:优先股(万元)': 'FFF428',  # (所有者权益科目)
    '429永续债(万元)': 'FFF429',  # (所有者权益科目)
    '430债权投资(万元)': 'FFF430',
    '431其他债权投资(万元)': 'FFF431',
    '432其他权益工具投资(万元)': 'FFF432',
    '433其他非流动金融资产(万元)': 'FFF433',
    '434合同负债(万元)': 'FFF434',
    '435合同资产(万元)': 'FFF435',
    '436其他资产(万元)': 'FFF436',
    '437应收款项融资(万元)': 'FFF437',
    '438使用权资产(万元)': 'FFF438',
    '439租赁负债(万元)': 'FFF439',
}

if __name__ == '__main__':
    pass
