# !/usr/bin/env python3
# -*- coding:utf-8 -*-

# @Datetime : 2020/10/20 1:36
# @Author   : Fangyang
# @Software : PyCharm

f074_097_income_statement_dict = {
    # 3. 利润表
    '074其中：营业收入': 'FFF074',
    '075其中：营业成本': 'FFF075',
    '076营业税金及附加': 'FFF076',
    '077销售费用': 'FFF077',
    '078管理费用': 'FFF078',
    '079堪探费用': 'FFF079',
    '080财务费用': 'FFF080',
    '081资产减值损失': 'FFF081',
    '082加：公允价值变动净收益': 'FFF082',
    '083投资收益': 'FFF083',
    '084其中：对联营企业和合营企业的投资收益': 'FFF084',
    '085影响营业利润的其他科目': 'FFF085',
    '086三、营业利润': 'FFF086',
    '087加：补贴收入': 'FFF087',
    '088营业外收入': 'FFF088',
    '089减：营业外支出': 'FFF089',
    '090其中：非流动资产处置净损失': 'FFF090',
    '091加：影响利润总额的其他科目': 'FFF091',
    '092四、利润总额': 'FFF092',
    '093减：所得税': 'FFF093',
    '094加：影响净利润的其他科目': 'FFF094',
    '095五、净利润': 'FFF095',
    '096归属于母公司所有者的净利润': 'FFF096',
    '097少数股东损益': 'FFF097',
}
if __name__ == '__main__':
    pass
