# !/usr/bin/env python3
# -*- coding:utf-8 -*-
# @Datetime : 2023/10/27 1:17
# @Author   : Fangyang
# @Software : PyCharm

f561_580_cash_flow_statement_dict = {
    '561加:其他原因对现金的影响2(万元)(现金的期末余额科目)': 'FFF561',
    '562客户存款和同业存放款项净增加额(万元)': 'FFF562',
    '563向中央银行借款净增加额(万元)': 'FFF563',
    '564向其他金融机构拆入资金净增加额(万元)': 'FFF564',
    '565收到原保险合同保费取得的现金(万元)': 'FFF565',
    '566收到再保险业务现金净额(万元)': 'FFF566',
    '567保户储金及投资款净增加额(万元)': 'FFF567',
    '568处置以公允价值计量且其变动计入当期损益的金融资产净增加额(万元)': 'FFF568',
    '569收取利息、手续费及佣金的现金(万元)': 'FFF569',
    '570拆入资金净增加额(万元)': 'FFF570',
    '571回购业务资金净增加额(万元)': 'FFF571',
    '572客户贷款及垫款净增加额(万元)': 'FFF572',
    '573存放中央银行和同业款项净增加额(万元)': 'FFF573',
    '574支付原保险合同赔付款项的现金(万元)': 'FFF574',
    '575支付利息、手续费及佣金的现金(万元)': 'FFF575',
    '576支付保单红利的现金(万元)': 'FFF576',
    '577其中:子公司吸收少数股东投资收到的现金(万元)': 'FFF577',
    '578其中:子公司支付给少数股东的股利、利润(万元)': 'FFF578',
    '579投资性房地产的折旧及摊销(万元)': 'FFF579',
    '580信用减值损失(万元)': 'FFF580',
}

if __name__ == '__main__':
    pass
