# !/usr/bin/env python3
# -*- coding:utf-8 -*-

# @Datetime : 2020/10/20 1:49
# @Author   : Fangyang
# @Software : PyCharm

f098_107_operating_dict = {
    # 4.1 经营活动 Operating
    '098销售商品、提供劳务收到的现金': 'FFF098',
    '099收到的税费返还': 'FFF099',
    '100收到其他与经营活动有关的现金': 'FFF100',
    '101经营活动现金流入小计': 'FFF101',
    '102购买商品、接受劳务支付的现金': 'FFF102',
    '103支付给职工以及为职工支付的现金': 'FFF103',
    '104支付的各项税费': 'FFF104',
    '105支付其他与经营活动有关的现金': 'FFF105',
    '106经营活动现金流出小计': 'FFF106',
    '107经营活动产生的现金流量净额': 'FFF107',
}

if __name__ == '__main__':
    pass
