# !/usr/bin/env python3
# -*- coding:utf-8 -*-

# @Datetime : 2020/10/20 1:50
# @Author   : Fangyang
# @Software : PyCharm

f108_119_investment_dict = {
    # 4.2 投资活动 Investment
    '108收回投资收到的现金': 'FFF108',
    '109取得投资收益收到的现金': 'FFF109',
    '110处置固定资产、无形资产和其他长期资产收回的现金净额': 'FFF110',
    '111处置子公司及其他营业单位收到的现金净额': 'FFF111',
    '112收到其他与投资活动有关的现金': 'FFF112',
    '113投资活动现金流入小计': 'FFF113',
    '114购建固定资产、无形资产和其他长期资产支付的现金': 'FFF114',
    '115投资支付的现金': 'FFF115',
    '116取得子公司及其他营业单位支付的现金净额': 'FFF116',
    '117支付其他与投资活动有关的现金': 'FFF117',
    '118投资活动现金流出小计': 'FFF118',
    '119投资活动产生的现金流量净额': 'FFF119',
}

if __name__ == '__main__':
    pass
