# !/usr/bin/env python3
# -*- coding:utf-8 -*-
# @Datetime : 2023/10/27 1:13
# @Author   : Fangyang
# @Software : PyCharm

f501_521_income_statement_dict = {
    '501稀释每股收益(元)': 'FFF501',
    '502营业总收入(万元)': 'FFF502',
    '503汇兑收益(万元)': 'FFF503',
    '504其中:归属于母公司综合收益(万元)': 'FFF504',
    '505其中:归属于少数股东综合收益(万元)': 'FFF505',
    '506利息收入(万元)': 'FFF506',
    '507已赚保费(万元)': 'FFF507',
    '508手续费及佣金收入(万元)': 'FFF508',
    '509利息支出(万元)': 'FFF509',
    '510手续费及佣金支出(万元)': 'FFF510',
    '511退保金(万元)': 'FFF511',
    '512赔付支出净额(万元)': 'FFF512',
    '513提取保险合同准备金净额(万元)': 'FFF513',
    '514保单红利支出(万元)': 'FFF514',
    '515分保费用(万元)': 'FFF515',
    '516其中:非流动资产处置利得(万元)': 'FFF516',
    '517信用减值损失(万元)': 'FFF517',
    '518净敞口套期收益(万元)': 'FFF518',
    '519营业总成本(万元)': 'FFF519',
    '520信用减值损失(万元、2019格式)': 'FFF520',
    '521资产减值损失(万元、2019格式)': 'FFF521',
}

if __name__ == '__main__':
    pass
