# !/usr/bin/env python3
# -*- coding:utf-8 -*-

# @Datetime : 2020/10/20 2:19
# @Author   : Fangyang
# @Software : PyCharm

f159_171_solvency_dict = {
    # 5. 偿债能力分析
    '159流动比率': 'FFF159',  # 流动资产/流动负债
    '160速动比率': 'FFF160',  # (流动资产-存货）/流动负债
    '161现金比率(%)': 'FFF161',  # (货币资金+有价证券)÷流动负债
    '162利息保障倍数': 'FFF162',  # (利润总额+财务费用（仅指利息费用部份）)/利息费用
    '163非流动负债比率(%)': 'FFF163',
    '164流动负债比率(%)': 'FFF164',
    '165现金到期债务比率(%)': 'FFF165',  # 企业经营现金净流入/(本期到期长期负债+本期应付票据)
    '166有形资产净值债务率(%)': 'FFF166',
    '167权益乘数(%)': 'FFF167',  # 资产总额/股东权益总额
    '168股东的权益/负债合计(%)': 'FFF168',  # 权益负债率
    '169有形资产/负债合计(%)': 'FFF169',  # 有形资产负债率
    '170经营活动产生的现金流量净额/负债合计(%)': 'FFF170',
    '171EBITDA/负债合计(%)': 'FFF171',
}

if __name__ == '__main__':
    pass
