# !/usr/bin/env python3
# -*- coding:utf-8 -*-

# @Datetime : 2020/10/20 2:29
# @Author   : Fangyang
# @Software : PyCharm

f193_209_profitability_dict = {
    # 8. 获利能力分析
    '193成本费用利润率(%)': 'FFF193',
    '194营业利润率': 'FFF194',
    '195营业税金率': 'FFF195',
    '196营业成本率': 'FFF196',
    '197净资产收益率': 'FFF197',
    '198投资收益率': 'FFF198',
    '199销售净利率(%)': 'FFF199',
    '200总资产报酬率': 'FFF200',
    '201净利润率': 'FFF201',
    '202销售毛利率(%)': 'FFF202',
    '203三费比重': 'FFF203',
    '204管理费用率': 'FFF204',
    '205财务费用率': 'FFF205',
    '206扣除非经常性损益后的净利润': 'FFF206',
    '207息税前利润(EBIT)': 'FFF207',
    '208息税折旧摊销前利润(EBITDA)': 'FFF208',
    '209EBITDA/营业总收入(%)': 'FFF209',
}

if __name__ == '__main__':
    pass
