# !/usr/bin/env python3
# -*- coding:utf-8 -*-

# @Datetime : 2020/10/20 2:29
# @Author   : Fangyang
# @Software : PyCharm

f219_229_cash_capability_dict = {
    # 10. 现金流量分析
    '219每股经营性现金流(元)': 'FFF219',
    '220营业收入现金含量(%)': 'FFF220',
    '221经营活动产生的现金流量净额/经营活动净收益(%)': 'FFF221',
    '222销售商品提供劳务收到的现金/营业收入(%)': 'FFF222',
    '223经营活动产生的现金流量净额/营业收入': 'FFF223',
    '224资本支出/折旧和摊销': 'FFF224',
    '225每股现金流量净额(元)': 'FFF225',
    '226经营净现金比率（短期债务）': 'FFF226',
    '227经营净现金比率（全部债务）': 'FFF227',
    '228经营活动现金净流量与净利润比率': 'FFF228',
    '229全部资产现金回收率': 'FFF229',
}

if __name__ == '__main__':
    pass
